Revit 2027 API
BuiltInFailures.AutoRouteFailures.DesignOptionConflictError Property
 The solution is failing to do the elements are not in the same Design Option.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DesignOptionConflictError { get; }
Public Shared ReadOnly Property DesignOptionConflictError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DesignOptionConflictError {
	FailureDefinitionId^ get ();
}
static member DesignOptionConflictError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace